sub_ses = "<p>设想这把梯子反映了社会是如何构成的。</p><p>梯子的顶端是那些境况最优越的人：他们拥有最多的钱财，受过最多的教育，工作也最受人尊敬。</p><p>梯子的底端是那些境况最糟糕的人：他们只有最少的钱，极少或没有受过教育，没有工作，或者只有没人想干或没人尊敬的工作。</p><p>现在想想你的家庭。请告诉我们，你认为你的家庭在这个梯子上处于什么位置。</p><p>选择与最能代表你家庭所处位置的梯级相对应的数字：</p>"
sub_ses_options = ["10", "9", "8", "7", "6", "5", "4", "3", "2", "1"]


obj_ses = "请选择你的最高受教育程度："
obj_ses_options = ["九年级/初中及以下", "上过一部分高中", "普通高中或职业高中毕业/高中等级学历", "一年或多年大学教育，无学位", "大专学历", "四年/五年制大学本科学位", "有过一些研究生经历"]  // how do we translate these into Chinese system?
    

ovs_exp = "你有多少海外经历？"
ovs_exp_options = ["没有海外经历", "一段海外经历", "两段海外经历", "三到五段海外经历", "六段或更多海外经历"]


resmobi_names = "<p>你从5岁起在哪些城市/城镇居住过？</p><p>请列出你在5岁时居住的城市/城镇名称，以及你在此后搬去过的所有城市/市镇名称，包括你现在居住的地方。</p><p>（可以清楚区分出来的村和县也算，但同一个城市/城镇/村里的不同地点不算）</p>"
resmobi_num = "<p>你从5岁起在多少不同的城市/城镇/村居住过？</p><p>数一数你在上一题的回答有几个，把总数填在这里：</p>"


lgfluency_preamble = "语言流利度："
lgfleuncy_superq = "在0到10的范围内，请从下拉菜单中分别选择你在说、理解、阅读英语时的熟练程度"
sp = "说"
sp_placeholder = "选择你说英语的熟练程度"
ud = "理解口语"
ud_placeholder = "选择你理解口语的熟练程度"
rd = "阅读"
rd_placeholder = "选择你阅读的熟练程度"
opts = ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"]


//uszipcode = "What are the first 3 digits of your zipcode?"


ask_feedback = "对于参加本次实验的体验，你有什么想告诉我们的吗？"


label_done = "完成!"